Repository: 84000/data-translation-memory
Catalog: toh1-2-v3.tmx
Source language: bo
Languages: en

source: གསོ་སྦྱོང་གི་གཞིའི་སྡོམ་ལ། མུ་སྟེགས་ཅན་དང་ཀ་བི་ན། །གནས་དང་རྒྱལ་པོ་སྦྱར་བ་མང་། །
en: From The Chapters on Monastic Discipline The Chapter on the Restoration Rite Prologue A global summary of The Chapter on the Restoration Rite: Tīrthika, Kapphiṇa, Site, the king, and several repetitions.

source: སྡོམ་ལ། མུ་སྟེགས་ཅན་དང་གསོལ་བ་དང་། །གནང་བ་དང་ནི་འདུག་པ་དང་། །བབ་ཅོལ་སྤོང་དང་ཞལ་ཏ་དང་། །བྱ་དང་གསོ་སྦྱོང་གནས་རྣམས་སོ། །
en: Tīrthika A summary: Tīrthika, the motion, Consent, seated practice, Meditation residence, manager, Acts, and the restoration rite site.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་འོད་མའི་ཚལ་ཀ་ལན་ད་ཀའི་གནས་ན་བཞུགས་སོ། །དེའི་ཚེ་ན་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་ནང་པར་ནང་པར་ཞིང་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོ་བར་བརྩོན་པར་གྱུར་ཏོ། །
en: Tīrthika The Blessed Buddha was staying at the Kalandakanivāpa in the Bamboo Grove near Rājagṛha when a great number of lay vow holders from Rājagṛha, who endeavored to see and pay their respects to the Blessed One every morning, thought, “The Blessed One has withdrawn into seclusion, as have the dedicated monks, so it is still too early for a visit to see and pay our respects to the Blessed One.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། ད་ལྟར་བཅོམ་ལྡན་འདས་ཀྱང་ནང་དུ་ཡང་དག་པར་འཇོག་པར་མཛད་ལ། དགེ་སློང་ཡིད་དུ་འཐད་པ་རྣམས་ཀྱང་ནང་དུ་ཡང་དག་འཇོག་པར་བྱེད་པས་བདག་ཅག་རེ་ཞིག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་བ་སྔས་ཀྱིས།
en: Therefore, let us visit the park of another group of wandering mendicant tīrthikas.”

source: བདག་ཅག་གཞན་མུ་སྟེགས་ཅན་ཀུན་དུ་རྒྱུ་དག་གི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དེར་དོང་ངོ་སྙམ་མོ་དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་གཞན་མུ་སྟེགས་ཅན་ཀུན་དུ་རྒྱུ་དག་གི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་གཞན་མུ་སྟེགས་ཅན་ཀུན་དུ་རྒྱུ་དག་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་།
en: With that, the great number of lay vow holders from Rājagṛha set out for the park of another group of wandering mendicant tīrthikas.

source: ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་སྣ་ཚོགས་བྱས་ཏེ་མཐའ་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་མུ་སྟེགས་ཅན་ཞིག་གིས་མུ་སྟེགས་ཅན་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: They were delighted to see the wandering mendicant tīrthikas together and, after various expressions of esteem, sat off to one side.

source: ཤེས་ལྡན་དག་བདག་ཅག་འབའ་ཞིག་ལ་འདུག་པ་དང་བྱ་བ་དང་གསོ་སྦྱོང་ཡོད་དམ།
en: One wandering mendicant then said to the other wandering mendicants, “Friends, are we the only ones with a seated practice, a protocol, and a restoration rite?

source: འོན་ཏེ་ཤཱཀྱའི་བུའི་དགེ་སྦྱོང་དག་ལ་ཡང་ཡོད།
en: Or do the ascetic sons of the Śākyan have them, too?”

source: དེ་ནས་མུ་སྟེགས་ཅན་ཞིག་གིས་མུ་སྟེགས་ཅན་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤེས་ལྡན་དག་བདག་ཅག་འབའ་ཞིག་ལ་འདུག་པ་དང་བྱ་བ་དང་གསོ་སྦྱོང་ཡོད་ཀྱི།
en: Another wandering mendicant replied, saying to the other wandering mendicants, “Friends, we alone have a seated practice, a protocol, and a restoration rite.

source: ཤཱཀྱའི་བུའི་དགེ་སྦྱོང་དག་ལ་ནི་མེད་དོ། །
en: The ascetic sons of the Śākyan do not have them.”

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་གཞན་མུ་སྟེགས་ཅན་ཀུན་དུ་རྒྱུ་དག་གིས་སྨྲས་པ་ལ་མངོན་པར་བསྟོད་པར་ཡང་མི་བྱེད།
en: The Motion The great number of lay vow holders from Rājagṛha neither praised what the other group of wandering mendicant tīrthikas had said nor did they repudiate it.

source: ཕྱིར་ལྡོག་པར་ཡང་མི་བྱེད་ཅིང་མངོན་པར་བསྟོད་པ་ཡང་མ་བྱས། ཕྱིར་བཟློག་པར་ཡང་མ་བྱས་པར་སྟན་དག་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Having neither praised nor repudiated it, they then rose from their seats and went to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་མཐའ་གཅིག་ཏུ་འཁོད་དོ། །
en: On reaching him, they bowed at his feet and sat off to one side.

source: མཐའ་གཅིག་ཏུ་འཁོད་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་གིས་གཞན་མུ་སྟེགས་ཅན་ཀུན་དུ་རྒྱུ་དག་དང་ལྷན་ཅིག་བར་སྐབས་སུ་གཏམ་ཅི་བརྗོད་པ་དེ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་རྒྱས་པར་གསོལ་ནས་འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏོ། །
en: Having sat off to one side, these lay vow holders from Rājagṛha related at length everything that had happened while among the other group of wandering mendicant tīrthikas and then appealed to the Blessed One: “O Blessed One!

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ་བདག་ཅག་གི་ལ་ཡང་མཆིས་པ་དང་། བགྱི་བ་དང་། གསོ་སྦྱོང་བཅའ་བར་གསོལ།
en: Out of compassion, please establish a seated practice, a protocol, and a restoration rite of our own.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: Consent By remaining silent, the Blessed One consented to the appeal made by the great number of lay vow holders from Rājagṛha.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་དགེ་བསྙེན་རབ་ཏུ་མང་པོ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་པ་དང་རྗེས་སུ་ཡི་རང་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་ངོ་། །
en: Understanding the Blessed One’s silence to be consent, the great number of lay vow holders from Rājagṛha praised and rejoiced in the Blessed One’s proclamation before taking their leave from his presence.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་དགེ་སློང་རྣམས་ཀྱིས་དེང་ཕྱིན་ཆད་འདུག་པ་དང་། བྱ་བ་དང་། གསོ་སྦྱོང་ལ་ཏྲོན་བྱ་བར་རྗེས་སུ་གནང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ཀྱིས་དེང་ཕྱིན་ཆད་འདུག་པ་དང་། བྱ་བ་དང་། གསོ་སྦྱོང་ལ་ཏྲོན་བྱ་བར་རྗེས་སུ་གནང་ངོ་ཞེས་བཀའ་སྩལ་ནས།
en: Seated Practice The Blessed One then said to the monks, “I hereby declare that henceforth monks should attend to a seated practice, a protocol, and a restoration rite.”

source: དེ་དག་གིས་འདུག་པ་ཅི་ལྟ་བུ་ཡིན་པ་དང་། བྱ་བ་ཅི་ལྟ་བུ་ཡིན་པ་དང་། གསོ་སྦྱོང་ཅི་ལྟ་བུ་ཡིན་པ་མི་ཤེས་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཚུར་ཤོག །
en: Not knowing what a seated practice, a protocol, or a restoration rite ought to be, the monks appealed to the Blessed One, who replied, “Come, monks.

source: འདུག་པ་ནི་རྣལ་འབྱོར་ཏེ། ལུས་འདི་ཉིད་རྐང་པའི་མཐིལ་ཡན་ཆད་ཀླད་པའི་སྐྲ་མན་ཆད་པགས་པ་ལ་ཐུག་གི་བར་དུ་ཇི་ལྟར་གནས་པ་དང་། ཅི་ལྟར་བྱས་པ་བཞིན་དུ་མི་གཙང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་སྟེ།
en: The seated practice is called yoga.

source: ལུས་འདི་ལ་སྐྲ་དང་ཁ་སྤུ་དང་། སེན་མོ་དང་སོ་དང་། རྡུལ་དང་། དྲི་མ་དང་། པགས་པ་དང་། ཤ་དང་། རུས་པ་དང་། རྒྱུས་པ་དང་། རྩ་དང་། མཁལ་མ་དང་། སྙིང་དང་། མཆིན་པ་དང་། གློ་བ་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། ཕོ་བ་དང་། ལོང་ཀ་དང་། ལྒང་པ་དང་། མཚེར་པ་དང་། ཕྱི་ས་དང་། མཆི་མ་དང་། སྣབས་དང་། ཞག་དང་། ཆུ་སེར་དང་། རྐང་དང་། ཚིལ་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། རྣག་དང་། ཁྲག་དང་། ཀླད་པ་དང་།
en: Reflect on this: no matter how you sit or what you do, the whole of this body, from the soles of the feet up to the hair on the crown and all the skin in between, is filled with all sorts of impurities—the hair on the head and face, the nails and teeth, the dirt, the grime, and the skin, flesh, bones, sinews, veins, kidneys, heart, spleen, lungs, intestines, colon, stomach, guts, bladder, liver, feces, tears, mucus, oils, lymph, marrow, fat, bile, phlegm, pus, blood, brains, meninges, and urine.”

source: ཀླད་རྒྱས་དང་། གཅིན་དག་ཡོད་དོ་སྙམ་དུ་སོ་སོར་རྟོགས་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་རྣལ་འབྱོར་བསྒོམ་པར་བྱའོ་ཞེས་བཀའ་སྩལ་ནས། དགེ་སློང་དག་སྤྱོད་ཡུལ་དུ་ཞུགས་པ་ན་ཡང་རྣལ་འབྱོར་སྒོམ་པར་བྱེད་པ་ན་དེ་དག་གླང་པོ་ཆེ་འཁྲུལ་པ་དང་།
en: Meditation Residence After the Blessed One instructed them to engage in yoga, the monks engaged in yoga even when out on their rounds.

source: རྟ་འཁྲུལ་པ་དང་། རྐང་ཐང་པ་འཁྲུལ་པ་དང་ལྷན་ཅིག་ཕྲད་ནས་འགྱེལ་བ་དང་བུབ་པར་གྱུར་ནས་མ་དད་པ་རྣམས་འཕགས་པ་དག་མི་མཐོང་ངམ་ཅི་ཞེས་ཅོ་འདྲི་བར་བྱེད་པ་དང་།
en: And when they did, they collided with wandering elephants, horses, and infantrymen, causing them to trip and fall, prompting those who lacked faith to taunt those noble ones: “Didn’t you see them?”

source: དེ་དག་རྣལ་འབྱོར་སྒོམ་མོ་ཞེས་ཟེར་བའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྱོད་ཡུལ་དུ་ཞུགས་པས་རྣལ་འབྱོར་བསྒོམ་པར་མི་བྱའོ། །
en: Told to engage in yoga, the monks appealed to the Blessed One and the Blessed One replied, “Those who are out on their rounds should not engage in yoga.”

source: དེ་དག་སྒོ་ཁང་དུ་རྣལ་འབྱོར་སྒོམ་པར་བྱེད་པ་ན་ཡུར་ནས་མ་དད་པ་རྣམས་འཕགས་པ་དག་ཅི་ཁྱེད་འདུ་བར་ཉལ་བའི་བརྟུལ་ཞུགས་ཅན་ཡིན་ནམ་ཞེས་ཅོ་འདྲི་བར་བྱེད་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་།
en: When they engaged in yoga at the monastery gatehouse, they fell asleep, prompting those who lacked faith to taunt those noble ones: “Hey you! Is it your practice to sleep in public?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒོ་ཁང་དུ་རྣལ་འབྱོར་བསྒོམ་པར་མི་བྱའོ། །
en: At this the monks appealed to the Blessed One and the Blessed One replied, “You should not engage in yoga at the gatehouse.”

source: དེ་དག་ཁྱམས་སུ་སྒོམ་པར་བྱེད་པ་ན་ཉེས་དམིགས་དེ་ཉིད་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱམས་སུ་རྣལ་འབྱོར་བསྒོམ་པར་མི་བྱའོ། །
en: When they engaged in yoga on the terrace and those same problems occurred, the Blessed One said, “You should not engage in yoga on the terrace.”

source: དེ་དག་གནས་ཁང་དུ་སྒོམ་པར་བྱེད་པ་ན་བསམ་གཏན་དག་གི་ཚེར་མ་ནི་སྒྲ་ཡིན་པས་སེམས་རྩེ་གཅིག་པ་ཉིད་ཀྱང་མི་ཐོབ་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གནས་ཁང་དུ་རྣལ་འབྱོར་བསྒོམ་པར་མི་བྱའོ། །དེ་དག་དགོན་པར་དོང་སྟེ་སྒོམ་པར་བྱེད་པ་ན་ཆོམ་རྐུན་པ་རྣམས་དང་། གཡོན་ཅན་རྣམས་དང་།
en: When they practiced in the residence hall, they failed to achieve single-pointed attention because noise is a thorn to concentration, so the monks appealed to the Blessed One and the Blessed One replied, “You should not engage in yoga in the residence hall.”

source: སེང་གེ་རྣམས་དང་། སྟག་རྣམས་དང་། གུང་རྣམས་དང་། གཟིག་རྣམས་ཀྱིས་བགྲོད་པར་གྱུར་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགོན་པར་རྣལ་འབྱོར་བསྒོམ་པར་མི་བྱའོ། །
en: When they went into the forest to practice, and bandits, rogues, lions, tigers, panthers, and leopards crossed their paths, the monks appealed to the Blessed One and the Blessed One replied, “You should not engage in yoga in the forest.”

source: དེ་དག་གྲོང་དང་ཉེ་བར་ལྷགས་ནས་སྒོམ་པར་བྱེད་པ་ན་མ་དད་པ་རྣམས་འཕགས་པ་དག་ཅི་ཁྱེད་ཅག་འགའ་ཞིག་ཤི་བ་དང་ལྡན་པར་མ་གྱུར་ཏམ་ཞེས་ཅོ་འདྲི་བར་བྱེད་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་།
en: When they practiced on the outskirts of towns, those who lacked faith taunted those noble ones: “Hey you! Are you dead or what?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཕྱོགས་དེ་ཡལ་ག་དག་གམ། སེག་དག་དང་། རེ་ལྡེ་དག་གིས་བསྐོར་བར་བྱའོ། །
en: At this the monks appealed to the Blessed One and the Blessed One replied, “You should surround a place with boughs, a lattice, or screens.”

source: དེ་དག་གིས་ཕྱོགས་ཡལ་ག་དག་གམ།
en: So they surrounded a place with boughs, a lattice, and screens, but those who lacked faith taunted those noble ones: “What is this?

source: སེག་དག་གམ། རེ་ལྡེ་དག་གིས་བསྐོར་བ་དང་མ་དད་པ་རྣམས་འཕགས་པ་དག་ཅི་འདི་རྒྱལ་མོ་ག་གོན་གྱི་ར་བའམ།
en: A garden for melons and radishes?”

source: ལ་ཕུག་གི་ར་བའམ་ཞེས་ཅོ་འདྲི་བར་བྱེད་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཕྱོགས་དེ་རྩིག་པ་དག་གམ། འོབས་དག་གིས་བསྐོར་བར་བྱའོ། །
en: At this the monks appealed to the Blessed One and the Blessed One replied, “You should surround the place with walls or a ditch.”

source: དེ་དག་གིས་ཕྱོགས་དེ་རྩིག་པ་དག་གམ། འོབས་དག་གིས་བསྐོར་བ་དང་། མ་དད་པ་རྣམས་འཕགས་པ་དག་ཅི་འདི་མ་དུ་ལུང་གའི་ར་བའམ།
en: So they surrounded the place with walls or ditches, but those who lacked faith taunted those noble ones: “What is this?

source: འོན་ཏེ་བལ་པོ་སེའུའི་ར་བ་ཡིན།
en: A garden for lemons and pomegranates?”

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: to which they replied, “We are practicing yoga.”

source: རྣལ་འབྱོར་སྒོམ་པའོ་ཞེས་ཟེར་བའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་སྤོང་ཁང་བརྩིག་པར་གནང་ངོ་། །
en: The monks then appealed to the Blessed One and the Blessed One replied, “I give consent to build a meditation residence.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྤོང་ཁང་བརྩིག་པར་བྱའོ་ཞེས་བཀའ་སྩལ་ནས། དེ་དག་གིས་སྤོང་ཁང་རྣམ་པ་ཇི་ལྟ་བུ་ཡིན་པ་མི་ཤེས་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤོང་ཁང་ནི་གཉིས་ཏེ།
en: Given consent by the Blessed One to build a meditation residence, but not knowing what a meditation residence ought to be like, the monks appealed to the Blessed One and the Blessed One replied, “There are two types of meditation residence: those in small clusters and those in large clusters.

source: ཆུང་ངུ་དང་། ཆེན་པོའོ། །ཆུང་ངུ་ནི་གནས་ཁང་གཉིས་ཀྱི་བར་དུ་སྲང་བཏོད་པའོ། །ཆེན་པོ་ནི་གནས་ཁང་བཅུའམ། བཅུ་གཉིས་ཀྱི་བར་དུ་སྲང་བཏོད་པའོ། །
en: The smaller has two dwellings with a passageway in the middle while the larger has ten or twelve dwellings with a passageway in the middle.”

source: དགེ་སློང་དག་གིས་གནས་ཁང་བྱས་ནས་སྦྱང་བྱེད་པ་བཞིན་དུ་སྒོ་དོད་པར་མི་བྱེད་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒོ་གདོད་པར་བྱའོ། །
en: When the monks built meditation residences, they built them like storerooms, that is, without a doorway, so the Blessed One said, “A doorway should be cut out.”

source: དགེ་སློང་དག་སྒོ་གླེགས་མི་འཛུད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks failed to install doors, the Blessed One said, “Doors should be installed.”

source: སྒོ་གླེགས་གཞུག་པར་བྱའོ། །དབྱེ་དཀའ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ཟུངས་གདགས་པར་བྱའོ། །
en: When the doors proved difficult to open, the Blessed One said, “Handles should be affixed to them.”

source: ཡང་མིག་སྒྲ་འཁྲོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོག་ཏུ་ཀོ་བའི་དུམ་བུ་གཞུག་པར་བྱའོ། །
en: When the rings of the door handles were found to make noise, the Blessed One said, “A piece of leather should be placed under them.”

source: གཅད་དཀའ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གནམ་གཟེར་དང་། འཁོར་གཏན་དང་། ཕྲེད་གཏན་གཞུག་པར་བྱའོ། །
en: When the doors proved difficult to close, the Blessed One said, “A cross bolt, lever, or bar should be installed.”

source: མུན་གནག་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐར་ཁུང་གདོད་པར་བྱའོ། །དམའ་བར་བཏོད་པ་ན་ཆོམ་རྐུན་པ་དང་།
en: When the meditation residences proved dark, the Blessed One said, “A window should be cut out.”

source: གཡོན་ཅན་དང་། སེང་གེ་དང་། སྟག་དང་། གུང་རྣམས་ཀྱིས་བགྲོད་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དམའ་བར་གདོད་པར་མི་བྱའོ། །
en: When the windows were cut out too low, bandits, rogues, lions, tigers, and leopards got in, so the Blessed One said, “They should not be cut out too low.”

source: མཐོན་པོ་གདོད་པ་ན་སྣང་བ་མི་གསལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the windows were cut out too high, the light was not bright enough, so the Blessed One said, “They should not be cut out too high.

source: མཐོན་པོར་གདོད་པར་མི་བྱ་བར་སུམ་གཉིས་དོར་བར་བྱ་ཞིང་སུམ་གཉིས་དོར་ནས་སུམ་ཆར་གདོད་པར་བྱའོ། །
en: Leave two-thirds and cut them out of the remaining third.”

source: དེ་དག་གོང་དུ་སུམ་གཉིས་བོར་ཏེ་འོག་གི་སུམ་ཆར་དོད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོག་ཏུ་སུམ་གཉིས་བོར་ཏེ་གོང་དུ་སུམ་ཆ་བོར་བར་གདོད་པར་བྱའོ། །
en: When the monks left the upper two-thirds and cut out of the lower third, the Blessed One said, “Leave the lower two-thirds and cut the windows out of the remaining third above.”

source: དགེ་སློང་དག་ཕྱི་ཡངས་ཤིང་ནང་རུབ་པར་བྱེད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐར་ཁུང་རྒྱ་མཚོའི་རྣམ་པ་ལྟ་བུར་གདོད་པར་བྱ་སྟེ།
en: When the monks cut out wide apertures that tapered in, the Blessed One said, “Windows should be shaped like the sea, with a narrow aperture and broad interior.”

source: ཕྱི་རུབ་ལ་ནང་ཡངས་པར་བྱའོ། །ཁྭ་དང་། མཆིལ་པ་དང་། ཕུག་རོན་དག་འཇུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When crows, sparrows, and pigeons flew in, the Blessed One said, “The windows should be latticed.”

source: སྐར་ཁུང་དྲ་བ་ཅན་དུ་བྱའོ། །སྦྲང་བུ་ཏྲེ་མ་བུ་ཀ་དང་། ཏྲེ་ལ་ཏ་དག་འཇུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒོ་གླེགས་གཞུག་པར་བྱའོ། །
en: When house- and horseflies flew in, the Blessed One said, “The windows should have shutters.”

source: རླུང་གིས་འབྱེད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཕྲེད་གཏན་གཞུག་པར་བྱའོ། །
en: When wind blew the shutters open, the Blessed One said, “A bar should be installed.”

source: གཅད་དཀའ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གནམ་གཟེར་དང་འཁོར་གཏན་གཞུག་པར་བྱའོ། །དབྱེ་དཀའ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དབྱུག་གུ་སྐམ་ཀ་བྱས་ཏེ་ཕྲེད་གཏན་དང་། གནམ་གཟེར་དང་།
en: When the shutters proved difficult to close, the Blessed One said, “Cross bolts and levers should be installed.”

source: འཁོར་གཏན་དག་གིས་ནི་གཅད་པར་བྱའོ། །
en: When the shutters proved difficult to open, the Blessed One said, “Fashion a key lever from wood and use it to open the window, and a bar, a cross bolt, or a lever to close it.”

source: དབྱུག་གུ་སྐམ་ཀས་ནི་དབྱེ་བར་བྱའོ། །དེར་སྟན་དགོས་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སའི་སྟེགས་བུ་དག་བྱའོ། །
en: Since seats were needed in the meditation residence, the Blessed One said, “Fashion a cushion of earth.”

source: མཁྲང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྲིའུ་བྱའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཁྲིའུ་བྱའོ་ཞེས་བཀའ་སྩལ་ནས།
en: When these proved too hard, the Blessed One said, “Use a stool.”

source: དེ་དག་གིས་ཁྲིའུ་ཅི་འདྲ་བ་མི་ཤེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁོ་ར་ཁོར་ཡུག་ཏུ་ཁྲུ་བཞིས་འཁོར་བའི་ཁྲིའུ་བྱ་ཞིང་དེ་ཐགས་མས་བླ་བར་བྱའོ། །དེ་དག་གིས་ཐགས་མ་དུ་ཡོད་མི་ཤེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One told the monks to use a stool, but they did not know what such a stool ought to be like, so the Blessed One said, “Make a stool with a frame one cubit long on each side and a woven seat for comfort.”

source: ཐགས་མ་ནི་ལྔ་སྟེ། མུན་ཛའི་དང་། ཤ་ནའི་དང་། གྲེས་མའི་དང་། རས་མའི་དང་།
en: Since the monks did not know what weave to use, the Blessed One said, “There are five weaves: sedge, hemp, vālvaja grass, paṭa straw, and reed.”

source: སྦ་ཕྲ་མོའིའོ། །དེ་དག་མཁྲང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྟན་ནང་ཚངས་ཅན་གདིང་བར་བྱའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་སྟན་ནང་ཚངས་ཅན་དག་གདིང་བར་བྱའོ་ཞེས་བཀའ་སྩལ་ནས།
en: When the monks found these too hard, the Blessed One said, “Place a cushion over the seat.”

source: དེ་དག་གིས་སྟན་ནང་ཚངས་ཅན་ཅི་འདྲ་བ་མི་ཤེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྲིད་དུ་ཁྲུ་བཞི་པ་ཞེང་དུ་ཁྲུ་དོ་ཡོད་པ་ཉིས་ལྟབ་ཏུ་བྱས་ཏེ་དྲུབ་པར་བྱའོ། །དེའི་ནང་དུ་ཤིང་བལ་གྱིས་དགང་བར་བྱའོ། །
en: Since the monks did not know what a seat cushion ought to be like, the Blessed One said, “Sew together two pieces with a perimeter of four cubits, each side one cubit wide, and fill them with fibers.”

source: དེ་དག་གིས་ཤིང་བལ་དུ་ཡོད་མི་ཤེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤིང་བལ་དག་ནི་ལྔ་སྟེ། ཨརྒའི་ཤིང་བལ་དང་། ཀ་ཤི་ཀའི་ཤིང་བལ་དང་། ཨེར་ཀའི་ཤིང་བལ་དང་།
en: Since the monks did not know what fibers to use, the Blessed One said, “There are five types of fiber: arga fiber, kaśika fiber, erakā fiber, baka fiber, and śalmalī fiber.

source: སྤྲ་བའི་ཤིང་བལ་དང་། ཤལ་མ་ལིའི་ཤིང་བལ་དག་ཡིན་ནོ། །གཞན་ཡང་ལྔ་སྟེ། བལ་དང་། ཤ་ནའི་ཤིང་བལ་དང་།
en: Alternatively, the cushion may be filled with one of the following five: wool, hemp, cotton, cloth shreds, or pāmṣu plant fibers.”

source: རས་བལ་དང་། རས་མ་དང་། ལོ་མའི་ཚོགས་དག་གིས་བཀང་བ་དག་ཡིན་ནོ། །ཤིང་བལ་ཐམས་ཅད་ཕྱོགས་གཅིག་ཏུ་འཆུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མདོ་མདོར་སྐུད་པས་བྱ་རོག་རྐང་གི་གཟུངས་གདབ་པར་བྱའོ། །
en: When the cushions were filled, all of the fibers shifted to one side, so the Blessed One said, “Using thread, partition it into pockets with crow’s feet seams.”

source: འཁོད་པ་ན་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གདོས་བུ་གདགས་པར་བྱའོ། །
en: When the monks fell asleep while seated, the Blessed One said, “A jar should be tied.”

source: ཇི་ལྟར་གདགས་མི་ཤེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐུད་པ་བཏགས་ཏེ་རྣ་བ་ལ་གདགས་པར་བྱའོ། །
en: Since the monks did not know how to tie such a jar, the Blessed One said, “Tie it to the ear with string.”

source: འོན་ཀྱང་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks still fell asleep, the Blessed One said, “Prod [the meditator] with a rod.”

source: དབྱུག་གུ་གཟུགས་པར་བྱའོ། །དགེ་སློང་དག་དབྱུག་གུ་སྨྱིག་གུའི་བཅད་འཕྲོ་ལྟ་བུས་འཛུགས་པ་ན་རྨ་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲེའི་བཅད་འཕྲོ་ལྟ་བུར་བྱའོ། །
en: When the monks prodded them with a stylus-shaped rod, it left wounds, so the Blessed One said, “Use one shaped like a weighing pan.”

source: འོན་ཀྱང་སྣད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རས་མ་དག་གིས་དཀྲིས་ནས་དལ་བུས་ཁད་ཀྱིས་ཁད་ཀྱིས་གཟུགས་པར་བྱའོ། །
en: When that still hurt the monks, the Blessed One said, “Once it has been wrapped in a piece of cloth, gently prod with it.”

source: ཕོ་ལོང་འཕང་བར་བྱའོ། །དགེ་སློང་དག་གིས་མུན་ཁུང་དུ་འཕངས་པ་ན་དེ་འཁྱམས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks threw balls of yarn in the dark, they went astray, so the Blessed One said, “Attach it to a string and throw it.

source: ཐག་གུས་བཏགས་ཏེ་འཕང་བར་བྱ་ཞིང་དེ་ནས་ཡང་ཕྱིར་དྲང་བར་བྱའོ། །
en: Then you may draw it back.”

source: འོན་ཀྱང་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མདུན་དུ་མར་མེ་གཞག་པར་བྱའོ། །
en: When the monks still fell asleep, the Blessed One said, “Place a lamp in front.”

source: འོན་ཀྱང་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྐང་པ་གཅིག་བརྐྱང་བར་བྱའོ། །
en: When they still fell asleep, the Blessed One said, “Sit with one leg extended.”

source: འོན་ཀྱང་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྐང་པ་ཡ་གཅིག་ཀྱང་བརྐྱང་བར་བྱའོ། །
en: When they still fell asleep, the Blessed One said, “Sit with both legs extended.”

source: འོན་ཀྱང་ཡུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལངས་ཏེ་བཅག་པར་བྱའོ། །
en: When they still fell asleep, the Blessed One said, “Stand up and walk a bit.”

source: དགེ་སློང་དག་འཆག་པ་ན་འཐོམ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks walked, they did so in a disorderly fashion so the Blessed One said, “Grab hold of the rope.”

source: ཕྲེད་དག་ལ་འཇུ་བར་བྱའོ། །ལག་པས་ཆང་རྒྱུད་བྱེད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྦུ་བུ་བསྐོན་ལ་སྐུད་པས་བཏགས་པ་ལ་འཇུས་ཏེ་བཅག་པར་བྱའོ། །
en: When they followed the rope with their hands, the Blessed One said, “Punch a hole [in an object], affix it to the string, and hold on to that as you walk.”

source: མཆིལ་ལྷམ་དང་བཅས་པས་འཆག་པར་བྱེད་པ་ན་སྒྲ་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཆིལ་ལྷམ་ཅན་གྱིས་བཅག་པར་མི་བྱའོ། །
en: When they walked in sandals, they made noise, so the Blessed One said, “Do not walk in sandals.”

source: རྡུལ་གྱིས་རྐང་པ་གཉིས་མ་རུང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། པར་ཐང་གདིང་བར་བྱའོ། །སྣུམས་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When their feet got dirty, the Blessed One said, “Lay down a mat.”

source: དགེ་སློང་དགོངས་སྤོང་བ་པའི་ཀུན་དུ་སྤྱོད་པའི་ཆོས་དག་བཅའ་བར་བྱ་སྟེ།
en: When the mat became grimy, the Blessed One said, “Monks, I will establish the rules of customary conduct for meditators.

source: དགེ་སློང་སྤོང་བ་པས་ཞག་གསུམ་ཞིང་གསུམ་ཞིང་རྐང་པ་གཉིས་བསྐུ་བར་བྱའོ། །
en: Monk meditators should wash their feet every three days.

source: དགེ་སློང་སྤོང་བ་པས་ཀུན་དུ་སྤྱོད་པའི་ཆོས་ཇི་ལྟར་བཅས་པ་དག་ཡང་དག་པར་བླངས་ཏེ་འཇུག་པར་མི་བྱེད་ན་འགལ་ཚབས་ཅན་དུ་འགྱུར་རོ། །
en: Monk meditators should fully embrace the rules of customary conduct I have thus established. If they do not, they will commit a transgression.”

source: དེ་དག་དེར་མི་ཤོང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྟེང་དུ་རིམ་ཁང་གཉིས་པ་བྱའོ། །
en: When the monks could no longer fit in the meditation residence, the Blessed One said, “Erect a second story above.”

source: འཛེག་དཀའ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཐེམ་སྐས་བྱའོ། །
en: When it proved difficult to climb up, the Blessed One said, “Build a staircase.”

source: ལྟུང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks fell down, the Blessed One said, “Build a railing.”

source: ཁ་ཁྱེར་གྱིས་བསྐོར་བར་བྱའོ། །དེ་འཁྲུལ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྕགས་ཀྱི་གཟེར་བུ་དག་གིས་གདབ་པར་བྱའོ། །འོན་ཀྱང་མི་ཤོང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When it proved shaky, the Blessed One said, “Fasten it down with iron nails.”

source: ཕྱི་རོལ་དུ་སྤོང་ཁང་ཆེན་པོ་བྱའོ། །
en: When the monks could still not fit in the meditation hall, the Blessed One said, “Erect a ring of dwellings around the meditation hall.”

source: དེ་དག་སྒོ་སྤྲོད་དག་ཏུ་བྱེད་པ་ན་དེ་དག་ཕན་ཚུན་དག་ཏུ་སྣང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒོ་སྣོལ་མར་གདོད་པར་བྱའོ། །
en: When the monks cut out doorways, they could see one another, so the Blessed One said, “The doorways should be offset.

source: སྒོ་ཁང་བྱའོ། །
en: Build a gatehouse.

source: ཕུག་ཀྱང་བྱའོ། །
en: Build caves, too.”
